MIWAMIWAMIWA/psoc-hackathon/PSoC101/TEAMPROJECT.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "EZI2C.h"
#include "EZI2C_PINS.h"
#include "EZI2C_PVT.h"
#include "EZI2C_EZI2C.h"
#include "EZI2C_EZI2C_PVT.h"
#include "EZI2C_BOOT.h"
#include "Vin.h"
#include "Vin_aliases.h"
#include "ADC.h"
#include "LCD.h"
#include "Sound1.h"
#include "Sound2.h"
#include "Sound3.h"
#include "Sound4.h"
#include "buz.h"
#include "buz_aliases.h"
#include "But2.h"
#include "But2_aliases.h"
#include "But1.h"
#include "But1_aliases.h"
#include "But3.h"
#include "But3_aliases.h"
#include "But4.h"
#include "But4_aliases.h"
#include "LED4.h"
#include "LED4_aliases.h"
#include "LED3.h"
#include "LED3_aliases.h"
#include "LED2.h"
#include "LED2_aliases.h"
#include "LED1.h"
#include "LED1_aliases.h"
#include "MasterReg.h"
#include "EZI2C_SCBCLK.h"
#include "EZI2C_sda.h"
#include "EZI2C_sda_aliases.h"
#include "EZI2C_scl.h"
#include "EZI2C_scl_aliases.h"
#include "EZI2C_SCB_IRQ.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "LCD_LCDPort.h"
#include "LCD_LCDPort_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

